; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared3 - mode
	image1 - mode
	infrared2 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation6 - direction
	Star7 - direction
	Star4 - direction
	GroundStation5 - direction
	Star0 - direction
	GroundStation8 - direction
	GroundStation3 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument2 infrared2)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
)
(:goal (and
	(pointing satellite0 Star0)
	(pointing satellite1 GroundStation3)
	(have_image Planet9 infrared2)
	(have_image Star10 infrared3)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 spectrograph0)
	(have_image Phenomenon13 infrared3)
	(have_image Star14 spectrograph0)
))

)

; plan
1. (turn_to satellite1 groundstation3 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 groundstation3)
   goals met: 1 of 8
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 8
3. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 1 of 8
4. (turn_to satellite1 phenomenon13 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon13)
   goals met: 0 of 8
5. (turn_to satellite0 groundstation5 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 8
6. (take_image satellite1 phenomenon13 instrument2 infrared3)
   added: (have_image phenomenon13 infrared3)
   goals met: 1 of 8
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 8
8. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 1 of 8
9. (turn_to satellite0 planet11 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet11)
   goals met: 1 of 8
10. (take_image satellite0 planet11 instrument1 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 2 of 8
11. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 2 of 8
12. (take_image satellite0 planet12 instrument1 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 3 of 8
13. (turn_to satellite0 star14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star14)
   goals met: 3 of 8
14. (take_image satellite0 star14 instrument1 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 4 of 8
15. (turn_to satellite0 star0 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star0)
   goals met: 5 of 8
16. (turn_to satellite1 planet9 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet9)
   goals met: 5 of 8
17. (take_image satellite1 planet9 instrument2 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 6 of 8
18. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 6 of 8
19. (take_image satellite1 star10 instrument2 infrared3)
   added: (have_image star10 infrared3)
   goals met: 7 of 8
20. (turn_to satellite1 groundstation3 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation3)
   goals met: 8 of 8
